import React from 'react';
import useMobile from '../hooks/useMobile.tsx';

const ShortDesc: React.FC = () => {
    const isMobile = useMobile();
    
  return (
    <div className={` short-desc text-white ${!isMobile ? "text-[32px] mx-[60px] mt-[30px] mb-[100px]" : "text-[18px] m-[30px]"}`}>
        <p>
            12152 рік. Галактика Андромеди. Протягом століть планети жили у мирі та злагоді: обмінювались енергією, технологіями та мемами. Так і жила велична раса Оманів.
          </p>
          <br/>
        <p>
            Вони були дуже добрими, але мали одну велику проблему - вони не вміли літати. Тому вони створили величезний космічний корабель, щоб подорожувати між планетами. Корабель був настільки великим, що його назвали “Космічний Лев”.
        Але серед них був один дуже злий Оман, його так і назвали - містер Зло. Містер Зло знищив всю свою расу і став останнім Оманом, він планував знищити світ і для того він мав могутню зброю - “Крутий Пожирач Планет”.
          </p>
            <br/>
          <p>
              Але, на щастя, на його шляху стали троє могутніх створінь, які прозвали себе Хранителями. Вони піймали його, та ув’язнили, а три частини зброї розділили між собою і домовились охороняти, щоб навіть якщо містер Зло і повернеться, він не зміг знищити світ.
          </p>
            <br/>
        <p>
        Так і охороняли вони її 1000 років. До сьогоднішнього дня…
        </p>
    </div>
  );
}

export default ShortDesc;