import React from 'react';
import useMobile from '../hooks/useMobile.tsx';

interface TeamMember {
  role: string;
  names: string[];
}

const teamData: TeamMember[] = [
  {
    role: 'Режисер',
    names: ['Мартиняк Ярослав, НН-406, ІКНІ']
  },
  {
    role: 'Сценаристи',
    names: [
      'Мартиняк Ярослав, НН-406, ІКНІ',
      'Мінтус Станіслав, ПЗ-33, ІКНІ',
      'Кріслатий Дмитро, ПМ-43, ІМФН',
      'Лесяк Роман, ПМ-22, ІМФН',
      'Коломійчук Данило, КНСП-11, ІКНІ',
      'Сафвас Нестор, УП-11, ІКНІ',
    ]
  },
  {
    role: 'Звукорежисер',
    names: ['Подухайло Денис, ПП-12, ІКНІ']
  },
  {
    role: 'Світло',
    names: ['Буняк Юрій, ІМФН']
  },
  {
    role: 'Афіша',
    names: ['Варук Олександра, ВП-22, ІКНІ']
  },
  {
    role: 'Декоратори',
    names: [
      'Сабадош Артур, ПМ-13, ІМФН',
      'Норенко Дмитро, ПМ-13, ІМФН',
      'Бондарук Назар Андрійович, ПМ-12, ІМФН',
      'Салига Марʼяна, СР-11, ІГСН',
      'Резуненко Олександр, ОІ-15, ІКНІ',
      'Дідич Мирослав, ПП-14, ІКНІ',
      'Сушельницька Софія, ФІ-11, ІМФН',
      'Рурак Ірина, УП-11, ІКНІ',
      'Лутчин Лілія, ЕО-11Б, ІСТР',
      'Письмак Владислав, ОІ-12, ІКНІ',
      'Чечуліна Валерія, ПП-34, ІКНІ',
      'Пашко Руслана, ПМ-11, ІМФН',
      'Сабурова Анастасія, ПС-38, ІППО',
      'Шевчук Владислав, ОІ-15, ІКНІ',
      'Циганський Максим, ОІ-15, ІКНІ',
      'Калабська Віолетта, ПП-15, ІКНІ',
      'Терещенко Нікіта, ПТ-12, ІСТР'
    ]
  },
  {
    role: 'Костюмери',
    names: [
      'Гвоздовська Софія, ПМ-13, ІМФН',
      'Сабурова Анастасія, ПС-38, ІППО',
      'Пойта Анна, ПП-25, ІКНІ',
      'Варук Олександра, ВП-22, ІКНІ'
    ]
  },
  {
    role: 'PR',
    names: [
      'Письмак Владислав, ОІ-12, ІКНІ',
      'Подухайло Денис, ПП-12, ІКНІ',
      'Барчук Анна-Вікторія,  ФЛ-43, ІКНІ',
      'Лугова Ольга, ПТ-11, ІСТР',
      'Гвоздовська Софія, ПМ-13, ІМФН',
      'Пойта Анна, ПП-25, ІКНІ',
      'Тригобюк Марія-Вероніка, ФІ-11, ІМФН',
      'Скрипник Анна, ОІ-11, ІКНІ',
      'Пасіщук Алла, РІ-22, ІКНІ',
      'Сарвас Нестор, УП-11, ІКНІ'
    ]
  },
  {
    role: 'FR',
    names: [
      'Слюсар Вікторія, ФЛ-22, ІКНІ',
      'Яцик Семена, ФЛ-26, ІКНІ',
      'Терещенко Нікіта, ПТ-12, ІСТР',
      'Худницька Дарія, ВП-12, ІКНІ',
      'Нарепеха Олена, ФЛ-22, ІКНІ',
      'Добровольська Вікторія, ФЛ-24, ІКНІ',
      'Пасіщук Алла, РІ-23, ІКНІ',
      'Юдченко Катерина, ОІ-23, ІКНІ',
      'Стасюк Зоя, ПЗ-11, ІКНІ',
      'Калабська Віолетта, ПП-15, ІКНІ',
      'Мельник Христина, УП-11, ІКНІ',
      'Музичка Софія, ВП-22, ІКНІ',
      'Письмак Владислав, ОІ-12, ІКНІ',
      'Вантух Дарина, ФЛ-31, ІКНІ',
      'Чечуліна Валерія, ПП-34, ІКНІ',
      'Тиха Ольга, РІ-21, ІКНІ'
    ]
  },
  {
    role: 'Розробники сайту',
    names: [
      'Козовий Андрій, ПМ-22, ІМФН',
      'Климець Діана, РІ-12, ІКНІ',
      'Хавалко Андрій, ОІ-26, ІКНІ',
      'Андрусевич Андрій, ПП-14, ІКНІ'
    ]
  },
  {
    role: 'Дизайнери сайту',
    names: [
      'Хомицька Марта Тарасівна, СА-21, ІКНІ',
      'Жирош Яна Іванівна, СА-21, ІКНІ'
    ]
  }
];

const TeamList: React.FC = () => {
      const isMobile = useMobile();
  return (
    <div className={`team-list  text-white ${!isMobile ? "text-[21px] mx-[80px] my-[30px] mb-30" : "text-[14px] m-[30px] text-justify"}`}>
      {teamData.map((member, index) => (
        <div key={index} className="mb-3 text-base leading-relaxed">
          <span className="font-bold">{member.role}:</span>{' '}
          {member.names.join('; ')}
        </div>
      ))}
    </div>
  );
};

export default TeamList;
